ЗАДАНИЕ №1
1) Объявите три переменные: manager, name, currentUser.
2) Запишите строку "Вася" в переменную name.
3) Скопируйте значение из переменной name в manager.
4) Скопируйте значение из переменной manager в currentUser.
5) Выведите в консоль значение переменной currentUser. 

ЗАДАНИЕ №2 (/* Без запуска на компьютере определить что выведется в консоль. Потом проверить, запустив на компьютере и разобраться почему так. */)
let name = "Вася";
console.log( `hello ${1}` ); 
console.log( `hello ${"name"}` ); 
console.log( `hello ${name}` ); 

ЗАДАНИЕ №3 (/* Без запуска на компьютере определить что выведется. Потом проверить, запустив на компьютере и разобраться почему так. */)
" \n \n" - 2;
true + false;
false + false;
6 / "3";
"2" * "3";
7 / 0;
4 + 5 + "px";
"" + 3 + 0;
"" - 4 + 0;
"!" + 2 + 5;
"1" - 2;
"3px" - 2;
"  -9  " + 5;
"  -9  " - 5;
null + 1;
undefined + 1;

ЗАДАНИЕ №4 (/* Без запуска на компьютере определить что выведется. Потом проверить, запустив на компьютере и разобраться почему так. */)
2 > 4
undefined == null
undefined === null
false == 0
false == ""
false === ""

Задание №5
1) Создать объект animal с двумя свойствами, первое свойство будет тип животного со значением dog, второе свойство вес со значением 40
2) Добавить два свойства цвет и скорость с любыми значениями
3) удалить свойство вес
4) Изменить значение свойства цвет
5) Вывести в консоль полученый объект


